app/views/listings/_form.html.erb

    <%= f.input :quantity, :class => "input" %>
    <%= collection_select(:listing, :item_id, Item.all, :id, :kind) %>
---
SELECT "items".* FROM "items"