app/views/listings/edit.html.erb

    <%= f.input :quantity %>
    <%= collection_select(:listing, :item_id, Item.all, :id, :kind) %>
---
SELECT "items".* FROM "items"