app/views/users/show.html.erb

SELECT  1 AS one FROM "listings"  WHERE "listings"."user_id" = $1 LIMIT 1  [["user_id", 2]]
---
	<ul class="listings">
		<% if @user.listings && !@user.listings.empty? %>