app/views/pages/_listing.html.erb

SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
---
                <li class="exchange">
                    <% l.user.hosted_events.each do |e| %>