app/controllers/pages_controller.rb

SELECT "items".* FROM "items"
SELECT "events".* FROM "events"
SELECT "listings".* FROM "listings"  WHERE (title like '%orange%')  ORDER BY created_at DESC
SELECT  "users".* FROM "users"  WHERE "users"."id" = 2  ORDER BY "users"."id" ASC LIMIT 1
SELECT  "users".* FROM "users" INNER JOIN "events_hosts" ON "users"."id" = "events_hosts"."host_id" WHERE "events_hosts"."event_id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["event_id", 1]]
SELECT DISTINCT "events".* FROM "events"
---
  def home
    @items = Item.all
    if !params[:search]
      @events = Event.all
      @listings = Listing.all
      @hash = Gmaps4rails.build_markers(@events) do |event, marker|
        marker.lat event.latitude
        marker.lng event.longitude
        marker.infowindow render_to_string(:partial => "/events/show", :locals => { :object => event})
      end
    elsif !user_signed_in?
      @listings = Listing.search(params[:search]).order("created_at DESC")
      users = @listings.map { |l| l.user }
      @events = users.map { |u| u.events }.uniq.flatten